In [1]:
import pandas as pd, numpy as np

In [2]:
import sys
sys.path.append('./')
from process_acs import *
from process_decennial import *
from sample_data import *

In [3]:
%%time

asian_decennial = read_decennial(sex_by_age_asian_alone)

CPU times: user 1min 25s, sys: 17.1 s, total: 1min 42s
Wall time: 1min 42s

In [4]:
asian_decennial.head()

        pop_count  age_start  age_end  sex_id            geoid
391148          0          0        4       1  530010000010001
391149          0          0        4       1  530010000010001
391150          0          0        4       1  530010000010001
391151          0          0        4       1  530010000010001
391152          0          0        4       1  530010000010001

In [6]:
acs_wa2015 = load_incoming_data('wa', 2015)
acs_wa2015 = format_acs(acs_wa2015, ['racasn'], 2015)
acs_wa2015 = add_decennial_age_bins(acs_wa2015)

In [7]:
acs_wa2015.head()

,state,sex_id,age,racaian,racasn,racblk,racnhpi,racsor,racwht,race_count,pop_count,age_start,age_end,pop_proportion
124,WA,1,0,0,1,0,0,0,0,1,2293.0,0,4,0.156231
799,WA,1,1,0,1,0,0,0,0,1,4454.0,0,4,0.303468
138,WA,1,2,0,1,0,0,0,0,1,3074.0,0,4,0.209443
3884,WA,1,3,0,1,0,0,0,0,1,2825.0,0,4,0.192478
123,WA,1,4,0,1,0,0,0,0,1,2031.0,0,4,0.138380

In [8]:
# check proportions sum to 1
acs_wa2015.groupby(['sex_id','age_start','age_end']).sum().pop_proportion.unique()

array([1., 1.])

In [9]:
long_df = asian_decennial[asian_decennial.pop_count!=0].iloc[:100]
long_df.head()

        pop_count  age_start  age_end  sex_id            geoid
394202          2          0        4       1  530050000050005
394278          3          0        4       1  530050000050005
394353          3          0        4       1  530050000050005
394384         23          0        4       1  530050000050005
395264          2          0        4       1  530050000050005

In [10]:
single_years_df = generate_single_year_df(long_df, age_distribution=acs_wa2015)

In [11]:
single_years_df.head()

             geoid  sex_id  age  pop_count
0  530050000050005       1    0          7
1  530070000070007       1    0          1
2  530110000110011       1    0         63
3  530050000050005       1    1         15
4  530070000070007       1    1          6